In [1]:
import pandas as pd

In [2]:
ba = pd.read_csv('bratislava.csv')
ke = pd.read_csv('data/kosice.csv')
ni = pd.read_csv('data/nitra.csv')
os = pd.read_csv('data/ostrava.csv')
br = pd.read_csv('data/brno.csv')

In [3]:
ba.head()

   Unnamed: 0  cas_nakupu produkt  cena
0           1  2015-01-01  Mlieko     3
1           2  2015-01-01  Tricko    10
2           3  2015-01-01  Sveter    25
3           4  2015-01-01  Chlieb     2
4           5  2015-01-01  Mlieko     3

In [4]:
os.head()

   Unnamed: 0  cas_nakupu produkt  cena
0           1  2015-01-01   Chleb    40
1           2  2015-01-01   Triko   250
2           3  2015-01-01   Chleb    40
3           4  2015-01-01   Mleko    55
4           5  2015-01-01   Chleb    40

In [5]:
print(ba.produkt.unique())
print(ba.cena.unique())

print(os.produkt.unique())
print(os.cena.unique())

['Mlieko' 'Tricko' 'Sveter' 'Chlieb' 'Mobil' 'Tablet' 'Laptop']
[  3  10  25   2 230 350 540]
['Chleb' 'Triko' 'Mleko' 'Svetr' 'Laptop' 'Mobil' 'Tablet']
[   40   250    55   620 14500  6300  9200]

In [6]:
os['produkt'] = os['produkt'].replace('Chleb', 'Chlieb')
os['produkt'] = os['produkt'].replace('Svetr', 'Sveter')
os['produkt'] = os['produkt'].replace('Triko', 'Tricko')
os['produkt'] = os['produkt'].replace('Mleko', 'Mlieko')
os.head()

   Unnamed: 0  cas_nakupu produkt  cena
0           1  2015-01-01  Chlieb    40
1           2  2015-01-01  Tricko   250
2           3  2015-01-01  Chlieb    40
3           4  2015-01-01  Mlieko    55
4           5  2015-01-01  Chlieb    40

In [7]:
br['produkt'] = br['produkt'].replace('Chleb', 'Chlieb')
br['produkt'] = br['produkt'].replace('Svetr', 'Sveter')
br['produkt'] = br['produkt'].replace('Triko', 'Tricko')
br['produkt'] = br['produkt'].replace('Mleko', 'Mlieko')
br.head()

   Unnamed: 0  cas_nakupu produkt  cena
0           1  2015-01-01  Mlieko    55
1           2  2015-01-01  Mlieko    55
2           3  2015-01-01  Chlieb    40
3           4  2015-01-01  Tricko   250
4           5  2015-01-01  Mlieko    55

In [8]:
# aktuanlny kurz, zdroj google
kurz = 25.26
# [   40   250    55   620 14500  6300  9200]
br['cena'] = br['cena'].replace(40, 40/kurz)
br['cena'] = br['cena'].replace(250, 250/kurz)
br['cena'] = br['cena'].replace(55, 55/kurz)
br['cena'] = br['cena'].replace(620, 620/kurz)
br['cena'] = br['cena'].replace(14500, 14500/kurz)
br['cena'] = br['cena'].replace(6300, 6300/kurz)
br['cena'] = br['cena'].replace(9200, 9200/kurz)

br.head()

   Unnamed: 0  cas_nakupu produkt      cena
0           1  2015-01-01  Mlieko  2.177356
1           2  2015-01-01  Mlieko  2.177356
2           3  2015-01-01  Chlieb  1.583531
3           4  2015-01-01  Tricko  9.897070
4           5  2015-01-01  Mlieko  2.177356

In [9]:
os['cena'] = os['cena'].replace(40, 40/kurz)
os['cena'] = os['cena'].replace(250, 250/kurz)
os['cena'] = os['cena'].replace(55, 55/kurz)
os['cena'] = os['cena'].replace(620, 620/kurz)
os['cena'] = os['cena'].replace(14500, 14500/kurz)
os['cena'] = os['cena'].replace(6300, 6300/kurz)
os['cena'] = os['cena'].replace(9200, 9200/kurz)

In [10]:
os.head()

   Unnamed: 0  cas_nakupu produkt      cena
0           1  2015-01-01  Chlieb  1.583531
1           2  2015-01-01  Tricko  9.897070
2           3  2015-01-01  Chlieb  1.583531
3           4  2015-01-01  Mlieko  2.177356
4           5  2015-01-01  Chlieb  1.583531

In [11]:
ba['Mesto'] = 'bratislava'
ke['Mesto'] = 'kosice'
ni['Mesto'] = 'nitra'
os['Mesto'] = 'ostrava'
br['Mesto'] = 'brno'

ba['Krajina'] = 'sk'
ke['Krajina'] = 'sk'
ni['Krajina'] = 'sk'
os['Krajina'] = 'cz'
br['Krajina'] = 'cz'

In [12]:
predaje = pd.concat([ba, ke, ni, os, br], ignore_index=True)

In [13]:
predaje.head()

   Unnamed: 0  cas_nakupu produkt  cena       Mesto Krajina
0           1  2015-01-01  Mlieko   3.0  bratislava      sk
1           2  2015-01-01  Tricko  10.0  bratislava      sk
2           3  2015-01-01  Sveter  25.0  bratislava      sk
3           4  2015-01-01  Chlieb   2.0  bratislava      sk
4           5  2015-01-01  Mlieko   3.0  bratislava      sk

In [14]:
predaje['cas_nakupu'] = pd.to_datetime(predaje['cas_nakupu'])

predaje['kvartal'] = predaje['cas_nakupu'].dt.to_period('Q').astype(str)
predaje.head()

   Unnamed: 0 cas_nakupu produkt  cena       Mesto Krajina kvartal
0           1 2015-01-01  Mlieko   3.0  bratislava      sk  2015Q1
1           2 2015-01-01  Tricko  10.0  bratislava      sk  2015Q1
2           3 2015-01-01  Sveter  25.0  bratislava      sk  2015Q1
3           4 2015-01-01  Chlieb   2.0  bratislava      sk  2015Q1
4           5 2015-01-01  Mlieko   3.0  bratislava      sk  2015Q1

In [15]:
predaje['mesiac'] = predaje['cas_nakupu'].dt.month
predaje.head()

   Unnamed: 0 cas_nakupu produkt  cena       Mesto Krajina kvartal  mesiac
0           1 2015-01-01  Mlieko   3.0  bratislava      sk  2015Q1       1
1           2 2015-01-01  Tricko  10.0  bratislava      sk  2015Q1       1
2           3 2015-01-01  Sveter  25.0  bratislava      sk  2015Q1       1
3           4 2015-01-01  Chlieb   2.0  bratislava      sk  2015Q1       1
4           5 2015-01-01  Mlieko   3.0  bratislava      sk  2015Q1       1

In [16]:
df = predaje.drop(columns=['cas_nakupu'])

In [17]:
df.head()

   Unnamed: 0 produkt  cena       Mesto Krajina kvartal  mesiac
0           1  Mlieko   3.0  bratislava      sk  2015Q1       1
1           2  Tricko  10.0  bratislava      sk  2015Q1       1
2           3  Sveter  25.0  bratislava      sk  2015Q1       1
3           4  Chlieb   2.0  bratislava      sk  2015Q1       1
4           5  Mlieko   3.0  bratislava      sk  2015Q1       1

In [18]:
# mlieko, chlieb -- potraviny
# tricko, sveter -- oblecenie
# mobil, tablet, laptop -- elektro

category_mapping = {
    'Mlieko': 'potraviny',
    'Chlieb': 'potraviny',
    'Tricko': 'oblecenie',
    'Sveter': 'oblecenie',
    'Mobil': 'elektro',
    'Tablet': 'elektro',
    'Laptop': 'elektro'
}

df['kategoria'] = df['produkt'].map(category_mapping)
df.head()

   Unnamed: 0 produkt  cena       Mesto Krajina kvartal  mesiac  kategoria
0           1  Mlieko   3.0  bratislava      sk  2015Q1       1  potraviny
1           2  Tricko  10.0  bratislava      sk  2015Q1       1  oblecenie
2           3  Sveter  25.0  bratislava      sk  2015Q1       1  oblecenie
3           4  Chlieb   2.0  bratislava      sk  2015Q1       1  potraviny
4           5  Mlieko   3.0  bratislava      sk  2015Q1       1  potraviny